boys-no-time/wild-fire_stm32/PCR102_Truestudio_2_8_2/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#define  A111_SPI_HANDLE hspi2
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED2_Pin GPIO_PIN_13
#define LED2_GPIO_Port GPIOC
#define LED1_Pin GPIO_PIN_0
#define LED1_GPIO_Port GPIOA
#define Power_1_8_EN_Pin GPIO_PIN_1
#define Power_1_8_EN_GPIO_Port GPIOA
#define A111_SENSOR_INTERRUPT_Pin GPIO_PIN_12
#define A111_SENSOR_INTERRUPT_GPIO_Port GPIOB
#define A111_SPI_SCK_Pin GPIO_PIN_13
#define A111_SPI_SCK_GPIO_Port GPIOB
#define A111_SPI_MISO_Pin GPIO_PIN_14
#define A111_SPI_MISO_GPIO_Port GPIOB
#define A111_SPI_MOSI_Pin GPIO_PIN_15
#define A111_SPI_MOSI_GPIO_Port GPIOB
#define A111_SPI_SS_Pin GPIO_PIN_6
#define A111_SPI_SS_GPIO_Port GPIOC
#define A111_ENABLE_Pin GPIO_PIN_7
#define A111_ENABLE_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */


#define LED1_ON   HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
#define LED1_OFF  HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);

#define LED2_ON   HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
#define LED2_OFF  HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);


#define POWER_ON   HAL_GPIO_WritePin(Power_1_8_EN_GPIO_Port, Power_1_8_EN_Pin, GPIO_PIN_SET);
#define POWER_OFF	 HAL_GPIO_WritePin(Power_1_8_EN_GPIO_Port, Power_1_8_EN_Pin, GPIO_PIN_RESET);

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
